# 작업 1유형

## Q1. 국어,수학,영어,과학 과목 중 가장 많은 학생들이 응시한 시험을 선택하고 해당과목의 점수를 표준화 했을 때 가장 큰 표준화 점수를 구하여라

In [114]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p1.csv')
df

       학생    국어    수학    영어    과학
0    ID_0  63.0   NaN  79.0  84.0
1    ID_1  91.0  93.0   NaN  73.0
2    ID_2  59.0  55.0   NaN  56.0
3    ID_3  71.0  83.0  82.0   NaN
4    ID_4  62.0  72.0  56.0   NaN
5    ID_5   NaN  69.0  88.0  96.0
6    ID_6  83.0  92.0  69.0   NaN
7    ID_7  85.0   NaN  83.0  66.0
8    ID_8  96.0  75.0  86.0   NaN
9    ID_9  79.0  56.0  90.0   NaN
10  ID_10  68.0   NaN  69.0  62.0
11  ID_11  61.0  56.0   NaN  76.0
12  ID_12  86.0  96.0   NaN  87.0
13  ID_13   NaN  89.0  98.0  82.0
14  ID_14  79.0  55.0  69.0   NaN

In [115]:
df.describe() # 국어

              국어         수학         영어         과학
count  13.000000  12.000000  11.000000   9.000000
mean   75.615385  74.250000  79.000000  75.777778
std    12.379677  16.164636  12.107849  12.872235
min    59.000000  55.000000  56.000000  56.000000
25%    63.000000  56.000000  69.000000  66.000000
50%    79.000000  73.500000  82.000000  76.000000
75%    85.000000  89.750000  87.000000  84.000000
max    96.000000  96.000000  98.000000  96.000000

In [116]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaled_score = scaler.fit_transform(df[['국어']].dropna())
scaled_score.max()

1.713855688712825

## Q2. 32개의 변수간 상관관계를 확인 했을 때, var_11 컬럼과 상관계수의 절댓값이 가장 큰 변수를 찾아 해당 변수의 평균값을 구하여라

In [117]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_.csv')
df.head(5)

,var_1,var_2,var_3,var_4,var_5,var_6,var_7,var_8,var_9,var_10,...,var_23,var_24,var_25,var_26,var_27,var_28,var_29,var_30,var_31,var_32
0,-0.335864,-2.425701,0.452851,-1.381924,-0.425591,-1.461498,-0.417082,-0.944226,-0.351224,1.474046,...,1.715714,0.300227,0.439828,-0.094772,1.551995,3.308446,-0.391377,1.963829,-1.458605,-0.348652
1,0.803535,-0.699433,0.095579,0.788053,-0.267674,-0.370746,0.636034,-1.674584,-0.058465,-1.188973,...,-1.348879,-0.899480,-1.271886,0.333734,-0.373565,-2.091508,-0.715245,-0.688441,0.910927,-0.746899
2,-0.408470,-0.361105,-0.857278,0.338294,2.317821,-0.099928,0.557053,-0.847932,0.973471,0.101203,...,-0.388353,0.918553,-1.984422,0.385055,1.161414,-1.280253,2.831802,-0.953771,-0.228466,0.766254
3,-0.690599,0.777928,-0.079963,0.164086,1.721702,0.146761,-0.988636,0.885344,0.647053,0.674609,...,0.337074,-1.406224,-0.699728,-0.836068,-0.226315,1.260893,-0.781630,-0.219995,0.871289,0.017578
4,0.179819,-0.668267,0.381849,-0.884196,0.758519,-1.026190,0.986227,-1.663167,2.290551,0.564845,...,-0.700137,-0.153825,-1.835313,0.182131,0.890247,0.024791,1.489955,1.276357,-0.285144,1.066486

In [118]:
df.corr()['var_11'].abs().sort_values(ascending=False).index[1] # var_28

'var_28'

In [119]:
df['var_28'].mean()

-0.06289356546077182

## Q3. **var_6 컬럼의 1,3사분위수 각각 IQR의 1.5배 벗어난 이상치의 갯수를 구하라 **

In [120]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p3.csv')
df.head(5)

,var_1,var_2,var_3,var_4,var_5,var_6,var_7,var_8,var_9,var_10,var_11,var_12
0,-0.401584,0.007198,-0.134910,-0.419514,-0.686331,-1.174550,-0.499150,-0.557510,0.357347,0.844209,0.082097,0.475098
1,1.064622,-0.531247,0.571185,-0.762243,-1.456043,0.355432,0.880010,0.523183,-0.141733,0.301472,0.840299,-0.045113
2,0.900195,-1.148496,-0.718437,-2.315266,-0.755505,0.630923,0.586027,0.086497,-0.381657,-1.602532,1.566340,-0.654105
3,1.199227,-0.114200,0.101536,-1.851971,-0.672844,0.796077,0.644246,-0.836296,-1.707074,0.376281,1.303967,1.228015
4,0.607393,1.675917,1.063759,-0.799493,-0.959568,-0.103007,-0.245984,-0.059492,0.293592,-0.517044,0.100772,0.403833

In [121]:
Q1 = df['var_6'].quantile(0.25)
Q3 = df['var_6'].quantile(0.75)
IQR = Q3-Q1
min_outline = Q1 - 1.5*IQR
max_outline = Q3 + 1.5*IQR
len(df['var_6'][(df['var_6']<min_outline) | (df['var_6']>max_outline)])

8

# 작업2유형

## Q1. 종속변수 :이용금액 예측, 평가지표 : rmse

In [122]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_train2.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_test2.csv')

display(train.head(2))
test.head(2)

        ID      연월  업종명 이용자구분    성별  이용자수   이용건수        이용금액
0  ID_5020  202201  여관업    법인  알수없음  7693  12105  3049021809
1  ID_5021  202201  여관업  제주도민    남성  3990   4291   294163241

        ID      연월         업종명 이용자구분    성별    이용자수    이용건수
0  ID_2575  201911     한식 음식점업  제주도민    여성  153363  163462
1  ID_6637  202305  건강보조식품 소매업    법인  알수없음     136     144

In [123]:
train.isna().sum(), test.isna().sum()

(ID       0
 연월       0
 업종명      0
 이용자구분    0
 성별       0
 이용자수     0
 이용건수     0
 이용금액     0
 dtype: int64,
 ID       0
 연월       0
 업종명      0
 이용자구분    0
 성별       0
 이용자수     0
 이용건수     0
 dtype: int64)

In [124]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2245 entries, 0 to 2244
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      2245 non-null   object
 1   연월      2245 non-null   int64
 2   업종명     2245 non-null   object
 3   이용자구분   2245 non-null   object
 4   성별      2245 non-null   object
 5   이용자수    2245 non-null   int64
 6   이용건수    2245 non-null   int64
 7   이용금액    2245 non-null   int64
dtypes: int64(4), object(4)
memory usage: 140.4+ KB

In [125]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5020 entries, 0 to 5019
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5020 non-null   object
 1   연월      5020 non-null   int64
 2   업종명     5020 non-null   object
 3   이용자구분   5020 non-null   object
 4   성별      5020 non-null   object
 5   이용자수    5020 non-null   int64
 6   이용건수    5020 non-null   int64
dtypes: int64(3), object(4)
memory usage: 274.7+ KB

In [126]:
train.head()

        ID      연월          업종명 이용자구분    성별   이용자수   이용건수        이용금액
0  ID_5020  202201          여관업    법인  알수없음   7693  12105  3049021809
1  ID_5021  202201          여관업  제주도민    남성   3990   4291   294163241
2  ID_5022  202201          여관업  제주도민    여성   1495   1620   119277191
3  ID_5023  202201  전시 및 행사 대행업   내국인    남성  16299  18588   432933220
4  ID_5024  202201  전시 및 행사 대행업   내국인    여성  17350  19922   396316520

In [127]:
train.nunique()

ID       2245
연월         22
업종명        15
이용자구분       7
성별          3
이용자수     1839
이용건수     1856
이용금액     2244
dtype: int64

In [128]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2245 entries, 0 to 2244
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      2245 non-null   object
 1   연월      2245 non-null   int64
 2   업종명     2245 non-null   object
 3   이용자구분   2245 non-null   object
 4   성별      2245 non-null   object
 5   이용자수    2245 non-null   int64
 6   이용건수    2245 non-null   int64
 7   이용금액    2245 non-null   int64
dtypes: int64(4), object(4)
memory usage: 140.4+ KB

In [129]:
# type이 object은 변수 레이블 인코딩
# LightGBM은 피처 이름에 특수 문자가 포함된 경우 처리하지 못하고, 실행시간 1분미만으로 원핫인코딩 대신 레이블 인코딩 선택
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df = pd.concat([train,test],axis=0)
df = df.drop('ID',axis=1)
cols = df.select_dtypes(include="object").columns
cols
for col in cols:
    df[col] = encoder.fit_transform(df[col])
df.head()

       연월  업종명  이용자구분  성별   이용자수   이용건수          이용금액
0  202201    8      3   1   7693  12105  3.049022e+09
1  202201    8      5   0   3990   4291  2.941632e+08
2  202201    8      5   2   1495   1620  1.192772e+08
3  202201    9      1   0  16299  18588  4.329332e+08
4  202201    9      1   2  17350  19922  3.963165e+08

In [130]:
n_train = len(train)
train_df = df.iloc[:n_train]
test_df = df.iloc[n_train:]
test_df = test_df.drop('이용금액',axis=1)
test_df.head()

       연월  업종명  이용자구분  성별    이용자수    이용건수
0  201911   12      5   2  153363  163462
1  202305    0      3   1     136     144
2  202208    7      0   1      26      26
3  202010    5      0   1      83      87
4  202303    4      6   1      27      35

In [131]:
from sklearn.model_selection import train_test_split
y = train_df['이용금액']
X = train_df.drop('이용금액',axis=1)

X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [132]:
from sklearn.ensemble import RandomForestRegressor
from lightgbm import LGBMRegressor
from sklearn.metrics import mean_squared_error
import numpy as np

model_rf = RandomForestRegressor(random_state=42)
model_rf.fit(X_train, y_train)
y_pred_rf = model_rf.predict(X_test)
score_rf = mean_squared_error(y_test, y_pred_rf)
np.sqrt(score_rf)

204645542.23007306

In [133]:
from lightgbm import LGBMRegressor
model_lgbm = LGBMRegressor(random_state=42)
model_lgbm.fit(X_train, y_train)
y_pred_lgbm = model_lgbm.predict(X_test)
score_lgbm = mean_squared_error(y_test, y_pred_lgbm)
np.sqrt(score_lgbm)

219398705.21903247

In [134]:
y_pred = model_rf.predict(test_df)
y_pred

array([7.47518615e+09, 4.87946968e+07, 2.61024076e+06, ...,
       5.27776460e+09, 9.36554705e+08, 8.88352544e+08])

In [135]:
result = pd.DataFrame({
    "이용금액":y_pred
})

result

              이용금액
0     7.475186e+09
1     4.879470e+07
2     2.610241e+06
3     1.031211e+07
4     5.272512e+05
...            ...
5015  3.746385e+08
5016  1.527021e+08
5017  5.277765e+09
5018  9.365547e+08
5019  8.883525e+08

[5020 rows x 1 columns]

In [112]:
# result.to_csv('result.csv', index=False)